eet-energy/picberry/src/devices/dspic33ckxxmp10x.cpp
		for(i=0; i<8; i++){
			if (flags.debug)
				fprintf(stderr, "\n addr = 0x%06X data = 0x%04X",
						(addr+i), data[i]);

			if (i%2 == 0 && data[i] != 0xFFFF) {
				mem.location[addr+i]        = data[i];
				mem.filled[addr+i]      = 1;
			}

			if (i%2 == 1 && data[i] != 0x00FF) {
				mem.location[addr+i]        = data[i];
				mem.filled[addr+i]      = 1;
			}
		}

		if(counter != addr*100/stopaddr){
			counter = addr*100/stopaddr;
			if(flags.client)
				fprintf(stdout,"@%03d", counter);
			if(!flags.debug)
				fprintf(stderr,"\b\b\b\b\b[%2d%%]", counter);
		}

		/* TODO: checksum */
	}

	send_nop();
	send_nop();
	send_nop();
	reset_pc();
	send_nop();
	send_nop();
	send_nop();

	send_cmd(0x200F80);
	send_cmd(0x8802A0);
	send_cmd(0x200046);
	send_cmd(0x20F887);
	send_nop();

	addr = 0x00F80004;

	for(i=0; i<8; i++){
		send_cmd(0xBA0BB6);
		send_nop();
		send_nop();
		send_nop();
		send_nop();
		send_nop();
		data[0] = read_data();
		if (data[0] != 0xFFFF) {
			mem.location[addr+2*i] = data[0];
			mem.filled[addr+2*i] = 1;
		}
	}

	send_nop();
	send_nop();
	send_nop();
	reset_pc();
	send_nop();
	send_nop();
	send_nop();

	if(!flags.debug) cerr << "\b\b\b\b\b";
	if(flags.client) fprintf(stdout, "@FIN");
	write_inhx(&mem, outfile);
}

/* Write contents of the .hex file to the PIC */
void dspic33ckxxmp10x::write(char *infile)
{
	uint16_t i;
	uint16_t k;
	bool skip;
	uint32_t data[8],raw_data[6];
	uint32_t addr = 0;
	uint16_t hbyte = 0, lbyte = 0;
	uint32_t config_data = 0;

	unsigned int filled_locations=1;

	const char num_config_regs = 14;
	const char *regname[] = {"FSEC","FBSLIM","FOSCSEL","FOSC","FWDT", "FPOR", "FICD", "FDMTIVTL", "FDMTIVTH", "FDMTCNTL", "FDMTCNTH", "FDMT", "FDEVOPT", "FALTREG"};
	const int config_addr[] = {0x00AF00, 0x00AF10, 0x00AF18, 0x00AF1C, 0x00AF20, 0x00AF24, 0x00AF28, 0x00AF2C, 0x00AF30, 0x00AF34, 0x00AF38, 0x00AF3C, 0x00AF40, 0x00AF44};

	filled_locations = read_inhx(infile, &mem);
	if(!filled_locations) return;

	/****** ERASE CODE MEMORY ******/
	bulk_erase();


	/****** WRITE CODE MEMORY ******/

	if(flags.debug) cerr << "Writing program memory...\n";

	/* Exit reset vector */
	send_nop();
	send_nop();
	send_nop();
	reset_pc();
	send_nop();
	send_nop();
	send_nop();

	/* Initialize the TBLPAG register for writing to the latches */
	send_cmd(0x200FAC); // MOV #0xFA, W12
	send_cmd(0x8802AC); // MOV W12, TBLPAG

	if(!flags.debug) cerr << "[ 0%]";
	if(flags.client) fprintf(stdout, "@000");
	counter=0;

	for (addr = 0; addr < mem.code_memory_size; ){
		
		skip = 1;

		for (k = 0; k < 4; k += 2)
			if (mem.filled[addr + k]) skip = 0;

		if (skip) {
			addr = addr + 4;
			continue;
		}

		send_cmd(0x200000 | (mem.location[addr] << 4)); // MOV #<LSW0>, W0
		send_cmd(0x200001 | (0x00FFFF & ((mem.location[addr+3] << 8) | (mem.location[addr+1] & 0x00FF))) <<4); // MOV #<MSB1:MSB0>, W1
		send_cmd(0x200002 | (mem.location[addr+2] << 4)); // MOV #<LSW1>, W2

		/* Set the Read Pointer (W6) and load the (next set of) write latches */
		send_cmd(0xEB0300); // CLR W6
		send_nop();
		send_cmd(0xEB0380); // CLR W7
		send_nop();
		send_cmd(0xBB0BB6); // TBLWTL [W6++], [W7]
		send_nop();
		send_nop();
		send_cmd(0xBBDBB6); // TBLWTH.B [W6++], [W7++]
		send_nop();
		send_nop();
		send_cmd(0xBBEBB6); // TBLWTH.B [W6++], [++W7]
		send_nop();
		send_nop();
		send_cmd(0xBB0B96); // TBLWTL [W6++], [W7++]
		send_nop();
		send_nop();

		/* Set the NVMADRU/NVMADR register pair to point to the correct address */
		send_cmd(0x200003 | ((addr & 0x0000FFFF) << 4) ); // MOV #<DestinationAddress15:0>, W3
		send_cmd(0x200004 | ((addr & 0x00FF0000) >> 12) ); // MOV #<DestinationAddress23:16>, W4
		send_cmd(0x884693);	//MOV W3, NVMADR
		send_cmd(0x8846A4);	//MOV W4, NVMADRU

		/* Set the NVMCON to program two instruction words */
		send_cmd(0x24001A); // MOV #0x4001, W10
		send_nop();
		send_cmd(0x88468A); // MOV W10, NVMCON
		send_nop();
		send_nop();

		/**** ATTENTION!  ****/
		/**** INCORRECT DATASHEET -  SEQUENCE FOUND BY REVERSE ENGINEERING ****/
		// Unlock erase/write operation
		send_cmd(0x200558);
		send_cmd(0x8846B8);
		send_cmd(0x200AA9);
		send_cmd(0x8846B9);
		send_cmd(0xA8E8D1);
		send_nop();
		send_nop();
		send_nop();

		addr = addr + 4;

		delay_us(DELAY_P13);

		do{
			send_nop();
			send_cmd(0x804680);
			send_nop();
			send_cmd(0x887E60);
			send_nop();
			nvmcon = read_data();
			send_nop();
			send_nop();
			send_nop();
			reset_pc();
			send_nop();
			send_nop();
			send_nop();
		} while((nvmcon & 0x8000) == 0x8000);

		if(counter != addr*100/filled_locations){
			if(flags.client)
				fprintf(stdout,"@%03d", (addr*100/(filled_locations+0x100)));
			if(!flags.debug)
				fprintf(stderr,"\b\b\b\b\b[%2d%%]", addr*100/(filled_locations+0x100));
			counter = addr*100/filled_locations;
		}
	};

	if(!flags.debug) cerr << "\b\b\b\b\b\b";
	if(flags.client) fprintf(stdout, "@100");

	// delay_us(100000);

	/* WRITE CONFIGURATION WORDS */
	if(flags.debug)
		cerr << endl << "Writing Configuration registers..." << endl;

	//  Exit the Reset vector.
	send_nop();
	send_nop();
	send_nop();
	reset_pc();
	send_nop();
	send_nop();
	send_nop();

	/* Initialize the TBLPAG register for writing to the latches */
	send_cmd(0x200FAC); // MOV #0xFA, W12
	send_cmd(0x8802AC); // MOV W12, TBLPAG

	for(i=0; i<num_config_regs; i++)
	{
		addr = config_addr[i];

		if(mem.filled[addr]){

			/* Load W0:W1 with the next two Configuration Words to program. */
			send_cmd(0x200000 | ((0x0000FFFF & mem.location[addr]) << 4));
			send_cmd(0x200001 | ((((uint32_t)mem.location[addr] | 0xFF0000) & 0x00FF0000) >> 12) );
			send_cmd(0x200002 | ((0x0000FFFF & mem.location[addr+1]) << 4));
			send_cmd(0x200003 | ((((uint32_t)mem.location[addr+1] | 0xFF0000) & 0x00FF0000) >> 12) );

			/* Set the Write Pointer (W3) and load the write latches.*/
			send_cmd(0xEB0300);
			send_nop();
			send_cmd(0xBB0B00);
			send_nop();
			send_nop();
			send_cmd(0xBB9B01);
			send_nop();
			send_nop();
			send_cmd(0xBB0B02);
			send_nop();
			send_nop();
			send_cmd(0xBB9B03);
			send_nop();
			send_nop();

			/* Set the NVMADRU/NVMADR register pair to point to the correct Configuration Word address */
			send_cmd(0x200004 | ((addr & 0x0000FFFF) << 4) ); // MOV #<DestinationAddress15:0>, W3
			send_cmd(0x200005 | ((addr & 0x00FF0000) >> 12) ); // MOV #<DestinationAddress23:16>, W4
			send_cmd(0x884694);	//MOV W4, NVMADR
			send_cmd(0x8846A5);	//MOV W5, NVMADRU

