eet-energy/picberry/src/devices/dspic33ckxxmp10x.cpp
			/*  Set the NVMCON register to program two instruction words.*/
			send_cmd(0x24001A); // MOV #0x4001, W10
			send_nop();
			send_cmd(0x88468A); // MOV W10, NVMCON
			send_nop();
			send_nop();

			/**** ATTENTION!  ****/
			/**** INCORRECT DATASHEET -  SEQUENCE FOUND BY REVERSE ENGINEERING ****/
			// Unlock erase/write operation
			send_cmd(0x200558);
			send_cmd(0x8846B8);
			send_cmd(0x200AA9);
			send_cmd(0x8846B9);
			send_cmd(0xA8E8D1);
			send_nop();
			send_nop();
			send_nop();
			send_nop();
			send_nop();

			/* Generate clock pulses for program operation to complete until the WR bit is clear */

			do{
				send_nop();
				send_cmd(0x804680);
				send_nop();
				send_cmd(0x887E60);
				send_nop();
				nvmcon = read_data();
				send_nop();
				send_nop();
				send_nop();
				reset_pc();
				send_nop();
				send_nop();
				send_nop();
			} while((nvmcon & 0x8000) == 0x8000);
		} else if(flags.debug)
				fprintf(stderr,"\n - %s left unchanged", regname[i]);

		addr = addr+2;
	}

	if(flags.debug) cerr << endl;

	delay_us(100000);

	/***** VERIFY CODE MEMORY *****/
	if(!flags.noverify){
		if(!flags.debug) cerr << "[ 0%]";
		if(flags.client) fprintf(stdout, "@000");
		counter = 0;

		send_nop();
		send_nop();
		send_nop();
		reset_pc();
		send_nop();
		send_nop();
		send_nop();

		for(addr=0; addr < mem.code_memory_size; addr=addr+8) {

			skip=1;

			for(k=0; k<8; k+=2)
				if(mem.filled[addr+k])
					skip = 0;

			if(skip) continue;

			send_cmd(0x200000 | ((addr & 0x00FF0000) >> 12) );	// MOV #<DestAddress23:16>, W0
			send_cmd(0x8802A0);									// MOV W0, TBLPAG
			send_cmd(0x200006 | ((addr & 0x0000FFFF) << 4) );	// MOV #<DestAddress15:0>, W6

			/* Fetch the next four memory locations and put them to W0:W5 */
			send_cmd(0xEB0380);	// CLR W7
			send_nop();
			send_cmd(0xBA1B96);
			send_nop();
			send_nop();
			send_nop();
			send_nop();
			send_nop();
			send_cmd(0xBADBB6);
			send_nop();
			send_nop();
			send_nop();
			send_nop();
			send_nop();
			send_cmd(0xBADBD6);
			send_nop();
			send_nop();
			send_nop();
			send_nop();
			send_nop();
			send_cmd(0xBA1BB6);
			send_nop();
			send_nop();
			send_nop();
			send_nop();
			send_nop();
			send_cmd(0xBA1B96);
			send_nop();
			send_nop();
			send_nop();
			send_nop();
			send_nop();
			send_cmd(0xBADBB6);
			send_nop();
			send_nop();
			send_nop();
			send_nop();
			send_nop();
			send_cmd(0xBADBD6);
			send_nop();
			send_nop();
			send_nop();
			send_nop();
			send_nop();
			send_cmd(0xBA0BB6);
			send_nop();
			send_nop();
			send_nop();
			send_nop();
			send_nop();

			/* read six data words (16 bits each) */
			for(i=0; i<6; i++){
				send_cmd(0x887E60 + i);
				send_nop();
				raw_data[i] = read_data();
				send_nop();
			}

			send_nop();
			send_nop();
			send_nop();
			reset_pc();
			send_nop();
			send_nop();
			send_nop();

			/* store data correctly */
			data[0] = raw_data[0];
			data[1] = raw_data[1] & 0x00FF;
			data[3] = (raw_data[1] & 0xFF00) >> 8;
			data[2] = raw_data[2];
			data[4] = raw_data[3];
			data[5] = raw_data[4] & 0x00FF;
			data[7] = (raw_data[4] & 0xFF00) >> 8;
			data[6] = raw_data[5];

			for(i=0; i<8; i++){
				if (flags.debug)
					fprintf(stderr, "\n addr = 0x%06X data = 0x%04X", (addr+i), data[i]);

				if(mem.filled[addr+i] && data[i] != mem.location[addr+i]){
					fprintf(stderr,"\n\n ERROR at address %06X: written %04X but %04X read!\n\n",
									addr+i, mem.location[addr+i], data[i]);
					return;
				}

			}

			if(counter != addr*100/filled_locations){
				if(flags.client)
					fprintf(stdout,"@%03d", (addr*100/(filled_locations+0x100)));
				if(!flags.debug)
					fprintf(stderr,"\b\b\b\b\b[%2d%%]", addr*100/(filled_locations+0x100));
				counter = addr*100/filled_locations;
			}
		}

		/***** VERIFY CONFIGURATION WORDS *****/
		for(unsigned short i=0; i<num_config_regs; i++)
		{
			send_nop();
			send_nop();
			send_nop();
			reset_pc();
			send_nop();
			send_nop();
			send_nop();

			send_cmd(0x200000 | ((config_addr[i] & 0x00FF0000) >> 12) );
			send_cmd(0x20FCC7);
			send_cmd(0x8802A0);
			send_cmd(0x200006 | ((0x0000FFFF & config_addr[i]) << 4));
			send_nop();

			send_cmd(0xBA8B96);
			send_nop();
			send_nop();
			send_nop();
			send_nop();
			send_nop();
			hbyte = read_data();

			send_cmd(0xBA0B96);
			send_nop();
			send_nop();
			send_nop();
			send_nop();
			send_nop();
			lbyte = read_data();

			config_data = (0x00FFFF & ((hbyte << 16) | lbyte));

			if(flags.debug)
				fprintf(stderr,"\n - %s: 0x%02x", regname[i], (hbyte << 16) | lbyte);

			if(mem.filled[config_addr[i]] && config_data != mem.location[config_addr[i]])
			{
				fprintf(stderr,"\n\n ERROR at config address %06X: written %04X but %04X read!\n\n",
								config_addr[i], mem.location[config_addr[i]], config_data);
				return;
			}
		}

		if(!flags.debug) cerr << "\b\b\b\b\b";
		if(flags.client) fprintf(stdout, "@FIN");
	}
	else{
		if(flags.client) fprintf(stdout, "@FIN");
	}
}

/* write to screen the configuration registers, without saving them anywhere */
void dspic33ckxxmp10x::dump_configuration_registers(void)
{
	const char *regname[] = {"FSEC","FBSLIM","FOSCSEL","FOSC","FWDT","FICD", "FDEVOPT", "FALTREG"};
	const int config_addr[] = {0x005780, 0x005790, 0x005798, 0x00579C, 0x0057A0, 0x0057A8, 0x0057AC, 0x0057B0};
	uint16_t hbyte = 0, lbyte = 0;

	cerr << endl << "Configuration registers:" << endl << endl;

	for(unsigned short i=0; i<8; i++)
	{

		send_nop();
		send_nop();
		send_nop();
		reset_pc();
		send_nop();
		send_nop();
		send_nop();

		send_cmd(0x200000 | ((config_addr[i] & 0x00FF0000) >> 12) );
		send_cmd(0x20F887);
		send_cmd(0x8802A0);
		send_cmd(0x200006 | ((0x0000FFFF & config_addr[i]) << 4));
		send_nop();

		send_cmd(0xBA8B96);
		send_nop();
		send_nop();
		send_nop();
		send_nop();
		send_nop();
		hbyte = read_data();

		send_cmd(0xBA0B96);
		send_nop();
		send_nop();
		send_nop();
		send_nop();
		send_nop();
		lbyte = read_data();

		fprintf(stderr," - %s: 0x%02x\n", regname[i], (hbyte << 16)|lbyte);
	}

	cerr << endl;
}

